{
  "ui": {
    "title": "Mi Diario de Recetas",
    "search_placeholder": "Buscar recetas...",
    "section_headers": {
      "dish_types": "Tipos de Platos",
      "dietary_options": "Opciones Dietéticas"
    },
    "categories": {
      "all": "Todas las Recetas",
      "main_courses": "Platos Principales",
      "desserts": "Postres",
      "soups": "Sopas"
    },
    "dietary_filters": {
      "vegan": "Vegano",
      "gluten_free": "Sin Gluten"
    }
  },
  "navigation": {
    "home": "Inicio",
    "breadcrumbs": {
      "separator": "›"
    }
  },
  "recipes": [
    {
      "id": "bourguignon",
      "title": "Bourguignon de Seitán",
      "image": "optimized/bourguignon.webp",
      "description": "Una versión vegana del plato francés clásico",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "2 cuadrados de chocolate negro",
        "500 ml de caldo de verduras",
        "1 cucharada de harina",
        "3 zanahorias",
        "1 cebolla",
        "70 ml de vino tinto de Borgoña",
        "500 g de seitán",
        "300 g de champiñones",
        "2 dientes de ajo",
        "20 g de margarina",
        "1 bouquet garni",
        "Sal y pimienta"
      ],
      "instructions": [
        "El día anterior o por la mañana para la cena:",
        "Enjuaga las verduras y pica finamente el ajo, la cebolla y los champiñones. Corta las zanahorias en trozos de 1 cm.",
        "En una olla a fuego medio, derrite la margarina. Añade el ajo, la cebolla, las zanahorias y los champiñones. Sofríe durante 5 minutos.",
        "Corta el seitán en cubos gruesos, similares a carne de estofado.",
        "Añade el seitán a la olla y déjalo dorar durante 2 minutos.",
        "Desglasa con todo el vino tinto, raspando los trozos del fondo con una espátula.",
        "Añade el bouquet garni y retira del fuego.",
        "Tapa y deja marinar toda la noche.",
        "Al día siguiente, vierte el caldo de verduras en la olla. Sazona con sal y pimienta.",
        "Vuelve a cocinar, hirviendo a fuego lento durante 1 hora a fuego medio-bajo. Antes de servir, añade los cuadrados de chocolate negro y remueve hasta que se derritan para ligar la salsa.",
        "¡Está listo! Sirve con arroz o pasta sin huevos."
      ]
    },
    {
      "id": "lentils_soup",
      "title": "Sopa de Lentejas",
      "image": "optimized/lentils_soup.webp",
      "description": "Sopa de lentejas caliente y nutritiva",
      "tags": ["soups", "vegan", "gluten_free"],
      "ingredients": [
        "3 cucharadas de aceite de oliva",
        "1 cebolla",
        "1 zanahoria",
        "1 puerro blanco",
        "1 chalota",
        "150g de lentejas verdes",
        "2 cubos de caldo",
        "1L de agua"
      ],
      "instructions": [
        "Pela el puerro blanco, la zanahoria, la cebolla y la chalota, y corta en mirepoix (dados pequeños).",
        "En una cazuela, pon tres cucharadas de aceite de oliva y haz sudar las verduras durante 5 a 10 minutos a fuego lento.",
        "Añade las lentejas, mezclándolas bien con las verduras para que se vuelvan translúcidas y absorban los sabores de las verduras.",
        "Añade 1 litro de agua, dos cubos de caldo, y deja hervir a fuego lento durante 3/4 de hora.",
        "Tritura la preparación (no uses un molinillo, la batidora deja trocitos pequeños para una consistencia más agradable).",
        "Sirve caliente con picatostes, un poco de queso rallado, o huevos duros."
      ]
    },
    {
      "id": "moussaka",
      "title": "Moussaka",
      "image": "optimized/moussaka.webp",
      "description": "Cazuela de berenjenas y patatas en capas",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "sal",
        "pimienta",
        "nuez moscada",
        "1 cucharada de miel",
        "30 g de mantequilla (o margarina para opciones veganas)",
        "aceite de oliva",
        "1 cebolla",
        "5 tomates (+/- un ladrillo de coulis de tomate)",
        "2 berenjenas",
        "5 patatas medianas",
        "500 g de carne picada (o sustituto vegetal)",
        "2 huevos (o sustituto vegetal)",
        "200 ml de leche (o leche vegetal)",
        "50 g de queso rallado (o sustituto vegetal)"
      ],
      "instructions": [
        "Precalienta el horno a 180°C (350°F).",
        "Corta las berenjenas en rodajas y ásalas hasta que estén tiernas.",
        "Cocina las patatas en rodajas hasta que estén casi tiernas.",
        "En una sartén, sofríe la cebolla picada en aceite de oliva.",
        "Añade la carne picada y cocínala hasta que esté dorada.",
        "Añade los tomates, la sal, la pimienta y deja hervir a fuego lento durante 10 minutos.",
        "En una fuente para gratinar, alterna las capas: patatas, berenjenas, salsa de carne.",
        "Prepara la bechamel mezclando la leche, los huevos, el queso, la nuez moscada.",
        "Vierte la bechamel por encima.",
        "Cocina en el horno durante 30-40 minutos hasta que la parte superior esté dorada."
      ]
    },
    {
      "id": "banana_bread",
      "title": "Pan de Plátano",
      "image": "optimized/banana_bread.webp",
      "description": "Pan húmedo de plátanos maduros",
      "tags": ["desserts", "vegan"],
      "ingredients": [
        "4 plátanos maduros medianos",
        "120g de azúcar",
        "75ml de aceite de girasol",
        "240g de harina de trigo",
        "3 cucharaditas de levadura en polvo",
        "40g de nueces picadas (opcional)",
        "40g de chips de chocolate o chocolate picado (opcional)"
      ],
      "instructions": [
        "Precalienta el horno a 200°C.",
        "Aplasta los plátanos en un tazón grande con la ayuda de un tenedor. Luego, añade el azúcar y el aceite de girasol y mezcla bien.",
        "Añade la harina y la levadura y mezcla de nuevo. Finalmente, añadimos opcionalmente las nueces y los chips de chocolate y mezclamos.",
        "Engrasa el molde (puedes usar margarina, aceite de oliva, aceite de coco, spray de cocina...) y vierte la masa en el molde. Opcionalmente, puedes espolvorear un poco de azúcar encima para hacerlo más crujiente.",
        "Hornea durante 40 minutos a 200°C con el horno previamente precalentado. Después de 20 minutos, echaremos un vistazo para ver si se está dorando demasiado por encima. Si es así, solo tienes que cubrirlo con papel de aluminio y dejarlo 20 minutos más.",
        "Déjalo enfriar antes de desmoldar. Si quieres desmoldarlo antes, puede romperse."
      ]
    },
    {
      "id": "chocolate_truffles",
      "title": "Trufas de Chocolate",
      "image": "optimized/chocolate_truffles.webp",
      "description": "Trufas de chocolate ricas y cremosas",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "80g de azúcar glas",
        "100g de mantequilla sin sal",
        "250g de chocolate negro",
        "2 yemas de huevo",
        "7.5g de azúcar de vainilla",
        "50g de cacao"
      ],
      "instructions": [
        "Rompe el chocolate en trozos pequeños en un plato resistente al calor. Funde al baño maría.",
        "Añade gradualmente la mantequilla cortada en pequeños cubos. Mezcla.",
        "Cuando la mantequilla se haya derretido en el chocolate, retira el plato del fuego, añade las yemas de huevo, el azúcar de vainilla (añade crujido, si quieres una textura suave, añade 10 g de azúcar glas y 1 gota de vainilla líquida) y el azúcar glas. Mezcla todo bien.",
        "Pon la masa en la nevera durante al menos una hora para que se solidifique.",
        "Luego, forma pequeñas bolas de masa con las manos, enróllalas en el cacao y colócalas en un plato."
      ]
    },
    {
      "id": "rice_pudding",
      "title": "Arroz con Leche",
      "image": "optimized/rice_pudding.webp",
      "description": "Arroz con leche cremoso y reconfortante",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "naranja o clementina",
        "5 cucharadas de azúcar",
        "1L de leche",
        "200 g de arroz blanco redondo",
        "1 sobre de azúcar de vainilla o aroma de vainilla"
      ],
      "instructions": [
        "Hierve la leche con el azúcar, el azúcar de vainilla y la ralladura de tu elección.",
        "Cuando la leche hierva, echa el arroz y baja el fuego para que hierva muy lentamente; el arroz debe cocerse muy lentamente.",
        "Cuando el arroz se acerque al nivel de la leche, apaga el fuego y deja enfriar; el arroz terminará de absorber la leche mientras se enfría.",
        "Este postre se puede servir caliente o frío, según tu gusto."
      ]
    },
    {
      "id": "pizza_dough",
      "title": "Masa de Pizza",
      "image": "optimized/pizza_dough.webp",
      "description": "Masa de pizza casera clásica",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "350g de harina (tipo masa de pan) + 100g para trabajar la masa",
        "2 cucharaditas de sal",
        "1 sobre de levadura de panadero",
        "3 cucharadas de aceite de oliva",
        "25cl de agua templada"
      ],
      "instructions": [
        "Poner 350g de harina en un bol grande y añadir sucesivamente la sal, la levadura de panadero y el aceite de oliva.",
        "Verter poco a poco el agua templada mientras se mezcla con una cuchara de madera.",
        "Remover durante mucho tiempo hasta obtener una masa que se despegue del bol.",
        "Dejar reposar la masa durante 1 hora cubriendo el bol con un paño en un lugar cálido.",
        "Después del tiempo de reposo, poner harina en tu superficie de trabajo y colocar la masa de pizza sobre ella.",
        "Trabajarla como se trabajaría una masa de pan.",
        "Dar forma a tu pizza a las dimensiones de tu bandeja de horno, idealmente colocando la masa sobre papel de horno.",
        "Adornar tu pizza según tus deseos o tus sobras en la nevera."
      ]
    },
    {
      "id": "brownie",
      "title": "Brownie",
      "image": "optimized/brownie.webp",
      "description": "Brownie de chocolate rico y cremoso",
      "tags": ["desserts"],
      "ingredients": [
        "250g de chocolate de repostería",
        "150g de mantequilla",
        "150g de azúcar",
        "60g de harina",
        "sal",
        "1 sobre de azúcar de vainilla",
        "3 huevos"
      ],
      "instructions": [
        "Derrite el chocolate roto en trozos con la mantequilla.",
        "Mientras tanto, bate los huevos con el azúcar hasta que la mezcla se blanquee.",
        "Añade la harina, el azúcar de vainilla, y añade el chocolate.",
        "Vierte todo en un molde, y hornea a 180°C (termostato 6) durante 15 min...",
        "¡Y ya está!"
      ]
    }
  ]
} 