{
  "ui": {
    "title": "Mon Journal de Recettes",
    "search_placeholder": "Rechercher des recettes...",
    "section_headers": {
      "dish_types": "Types de Plats",
      "dietary_options": "Options Alimentaires"
    },
    "categories": {
      "all": "Toutes les Recettes",
      "main_courses": "Plats Principaux",
      "desserts": "Desserts",
      "soups": "Soupes"
    },
    "dietary_filters": {
      "vegan": "Végétalien",
      "gluten_free": "Sans Gluten"
    }
  },
  "navigation": {
    "home": "Accueil",
    "breadcrumbs": {
      "separator": "›"
    }
  },
  "recipes": [
    {
      "id": "bourguignon",
      "title": "Bourguignon de Seitan",
      "image": "optimized/bourguignon.webp",
      "description": "Une version végétalienne du plat français classique",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "2 carrés de chocolat noir",
        "500 ml de bouillon de légumes",
        "1 cuillère à soupe de farine",
        "3 carottes",
        "1 oignon",
        "70 ml de vin rouge de Bourgogne",
        "500 g de seitan",
        "300 g de champignons",
        "2 gousses d'ail",
        "20 g de margarine",
        "1 bouquet garni",
        "Sel et poivre"
      ],
      "instructions": [
        "La veille ou le matin pour le dîner :",
        "Rincez les légumes et hachez finement l'ail, l'oignon et les champignons. Coupez les carottes en morceaux de 1 cm.",
        "Dans une casserole à feu moyen, faites fondre la margarine. Ajoutez l'ail, l'oignon, les carottes et les champignons. Faites revenir pendant 5 minutes.",
        "Coupez le seitan en gros cubes, similaires à de la viande de ragoût.",
        "Ajoutez le seitan à la casserole et laissez-le dorer pendant 2 minutes.",
        "Déglacez avec tout le vin rouge, en grattant les morceaux du fond avec une spatule.",
        "Ajoutez le bouquet garni et retirez du feu.",
        "Couvrez et laissez mariner toute la nuit.",
        "Le lendemain, versez le bouillon de légumes dans la casserole. Assaisonnez avec du sel et du poivre.",
        "Remettez à cuire, en mijotant pendant 1 heure à feu moyen-doux. Avant de servir, ajoutez les carrés de chocolat noir et remuez jusqu'à ce qu'ils soient fondus pour lier la sauce.",
        "C'est prêt ! Servez avec du riz ou des pâtes sans œufs."
      ]
    },
    {
      "id": "lentils_soup",
      "title": "Soupe aux Lentilles",
      "image": "optimized/lentils_soup.webp",
      "description": "Soupe de lentilles chaude et nutritive",
      "tags": ["soups", "vegan", "gluten_free"],
      "ingredients": [
        "1 tasse de lentilles séchées",
        "1 oignon, coupé en dés",
        "2 carottes, hachées",
        "2 gousses d'ail, émincées",
        "4 tasses de bouillon de légumes",
        "1 feuille de laurier",
        "Sel et poivre au goût",
        "2 cuillères à soupe d'huile d'olive"
      ],
      "instructions": [
        "Chauffez l'huile d'olive dans une grande casserole à feu moyen.",
        "Ajoutez l'oignon coupé en dés et faites cuire jusqu'à ce qu'il soit translucide, environ 5 minutes.",
        "Ajoutez l'ail émincé et faites cuire pendant 1 minute jusqu'à ce qu'il soit parfumé.",
        "Ajoutez les carottes hachées et faites cuire pendant 3 minutes.",
        "Rincez les lentilles et ajoutez-les à la casserole avec le bouillon de légumes et la feuille de laurier.",
        "Portez à ébullition, puis réduisez le feu et laissez mijoter pendant 30-40 minutes jusqu'à ce que les lentilles soient tendres.",
        "Assaisonnez avec du sel et du poivre au goût.",
        "Retirez la feuille de laurier avant de servir."
      ]
    },
    {
      "id": "moussaka",
      "title": "Moussaka",
      "image": "optimized/moussaka.webp",
      "description": "Casserole d'aubergines et pommes de terre en couches",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "sel",
        "poivre",
        "noix de muscade",
        "1 cuillère à soupe de miel",
        "30 g de beurre (ou margarine pour les options végétaliennes)",
        "huile d'olive",
        "1 oignon",
        "5 tomates (+/- une brique de coulis de tomates)",
        "2 aubergines",
        "5 pommes de terre moyennes",
        "500 g de viande hachée (ou substitut végétal)",
        "2 œufs (ou substitut végétal)",
        "200 ml de lait (ou lait végétal)",
        "50 g de fromage râpé (ou substitut végétal)"
      ],
      "instructions": [
        "Préchauffez le four à 180°C (350°F).",
        "Coupez les aubergines en tranches et faites-les griller jusqu'à ce qu'elles soient tendres.",
        "Faites cuire les pommes de terre en tranches jusqu'à ce qu'elles soient presque tendres.",
        "Dans une poêle, faites revenir l'oignon haché dans l'huile d'olive.",
        "Ajoutez la viande hachée et faites-la cuire jusqu'à ce qu'elle soit dorée.",
        "Ajoutez les tomates, le sel, le poivre et laissez mijoter pendant 10 minutes.",
        "Dans un plat à gratin, alternez les couches : pommes de terre, aubergines, sauce à la viande.",
        "Préparez la béchamel en mélangeant le lait, les œufs, le fromage, la noix de muscade.",
        "Versez la béchamel sur le dessus.",
        "Faites cuire au four pendant 30-40 minutes jusqu'à ce que le dessus soit doré."
      ]
    },
    {
      "id": "banana_bread",
      "title": "Pain aux Bananes",
      "image": "optimized/banana_bread.webp",
      "description": "Pain moelleux aux bananes mûres",
      "tags": ["desserts", "vegan"],
      "ingredients": [
        "3 bananes mûres, écrasées",
        "1/3 tasse de beurre fondu (ou huile végétale)",
        "1 tasse de sucre",
        "1 œuf (ou 1 cuillère à soupe de graines de lin moulues + 3 cuillères à soupe d'eau)",
        "1 cuillère à café de vanille",
        "1 cuillère à café de bicarbonate de soude",
        "1 pincée de sel",
        "1 1/2 tasse de farine tout usage"
      ],
      "instructions": [
        "Préchauffez le four à 175°C (350°F).",
        "Graissez un moule à pain de 9x5 pouces.",
        "Dans un grand bol, mélangez les bananes écrasées et le beurre fondu.",
        "Mélangez le sucre, l'œuf et la vanille.",
        "Saupoudrez le bicarbonate de soude et le sel sur le mélange.",
        "Ajoutez la farine et mélangez juste jusqu'à ce que tout soit humecté.",
        "Versez dans le moule préparé.",
        "Faites cuire pendant 50-60 minutes jusqu'à ce qu'un cure-dent inséré au centre ressorte propre.",
        "Laissez refroidir pendant 10 minutes avant de démouler."
      ]
    },
    {
      "id": "chocolate_truffles",
      "title": "Truffes au Chocolat",
      "image": "optimized/chocolate_truffles.webp",
      "description": "Truffes au chocolat riches et crémeuses",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "200 g de chocolat noir de bonne qualité",
        "100 ml de crème épaisse",
        "2 cuillères à soupe de beurre",
        "1 cuillère à café d'extrait de vanille",
        "Cacao en poudre pour enrober"
      ],
      "instructions": [
        "Hachez finement le chocolat et placez-le dans un bol.",
        "Chauffez la crème jusqu'à ce qu'elle soit juste frémissante.",
        "Versez la crème chaude sur le chocolat et laissez reposer pendant 2 minutes.",
        "Remuez doucement jusqu'à ce que le chocolat soit complètement fondu.",
        "Ajoutez le beurre et la vanille, remuez jusqu'à ce que tout soit lisse.",
        "Couvrez et réfrigérez pendant au moins 2 heures.",
        "Avec une cuillère, formez de petites boules de la taille d'une noix.",
        "Roulez-les dans le cacao en poudre.",
        "Placez sur une plaque et réfrigérez jusqu'au moment de servir."
      ]
    },
    {
      "id": "rice_pudding",
      "title": "Riz au Lait",
      "image": "optimized/rice_pudding.webp",
      "description": "Riz au lait crémeux et réconfortant",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "1 tasse de riz à grain court",
        "4 tasses de lait",
        "1/3 tasse de sucre",
        "1 cuillère à café de vanille",
        "1/2 cuillère à café de cannelle",
        "1 pincée de sel",
        "2 cuillères à soupe de beurre"
      ],
      "instructions": [
        "Rincez le riz jusqu'à ce que l'eau soit claire.",
        "Dans une casserole moyenne, combinez le riz, le lait, le sucre et le sel.",
        "Portez à ébullition à feu moyen, en remuant fréquemment.",
        "Réduisez le feu et laissez mijoter, en remuant occasionnellement, pendant 20-25 minutes.",
        "Le riz doit être tendre et le mélange crémeux.",
        "Retirez du feu et ajoutez la vanille, la cannelle et le beurre.",
        "Remuez jusqu'à ce que le beurre soit fondu.",
        "Servez chaud ou froid, saupoudré de cannelle supplémentaire si désiré."
      ]
    }
  ]
} 