{
  "ui": {
    "title": "My Recipe Journal",
    "search_placeholder": "Search recipes...",
    "section_headers": {
      "dish_types": "Dish Types",
      "dietary_options": "Dietary Options"
    },
    "categories": {
      "all": "All Recipes",
      "main_courses": "Main Courses",
      "desserts": "Desserts",
      "soups": "Soups"
    },
    "dietary_filters": {
      "vegan": "Vegan",
      "gluten_free": "Gluten Free"
    }
  },
  "navigation": {
    "home": "Home",
    "breadcrumbs": {
      "separator": "›"
    }
  },
  "recipes": [
    {
      "id": "bourguignon",
      "title": "Seitan Bourguignon",
      "image": "optimized/bourguignon.webp",
      "description": "A hearty vegan version of the classic French dish",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "2 squares of dark chocolate",
        "500 ml of vegetable stock",
        "1 tablespoon of flour",
        "3 carrots",
        "1 onion",
        "70 ml of Bourgogne red wine",
        "500 g of seitan",
        "300 g of mushrooms",
        "2 cloves of garlic",
        "20 g of margarine",
        "1 bouquet garni",
        "Salt and pepper"
      ],
      "instructions": [
        "The day before or the morning for dinner:",
        "Rinse the vegetables and finely chop the garlic, onion, and mushrooms. Cut the carrots into 1 cm pieces.",
        "In a pot over medium heat, melt the margarine. Add the garlic, onion, carrots, and mushrooms. Sauté for 5 minutes.",
        "Cut the seitan into thick cubes, similar to stew meat.",
        "Add the seitan to the pot and let it sear for 2 minutes.",
        "Deglaze with all the red wine, scraping the bits off the bottom with a spatula.",
        "Add the bouquet garni and remove from heat.",
        "Cover and let marinate overnight.",
        "The next day, pour the vegetable stock into the pot. Season with salt and pepper.",
        "Cook again, simmering for 1 hour over medium-low heat. Before serving, add the squares of dark chocolate and stir until melted to bind the sauce.",
        "It's ready! Serve with rice or egg-free pasta."
      ]
    },
    {
      "id": "lentils_soup",
      "title": "Lentils Soup",
      "image": "optimized/lentils_soup.webp",
      "description": "Warm and nutritious lentil soup",
      "tags": ["soups", "vegan", "gluten_free"],
      "ingredients": [
        "3 tablespoons of olive oil",
        "1 onion",
        "1 carrots",
        "1 leek white",
        "1 shallot",
        "150g green lentils",
        "2 bouillon cubes",
        "1L of water"
      ],
      "instructions": [
        "Peel the white leek, carrot, onion and shallot, and cut into mirepoix (small dice).",
        "In a casserole, put three tablespoons of olive oil and sweat the vegetables which will for 5 to 10 minutes over low heat.",
        "Add the lentils, mixing them well with the vegetables so that they become translucent and absorb the flavors of the vegetables.",
        "Add 1 liter of water, two stock cubes, and simmer for 3/4 of an hour.",
        "Mix the preparation (no food mill, the mixer leaves small pieces for a nicer consistency).",
        "Serve hot with croutons, a little grated cheese, or boiled eggs."
      ]
    },
    {
      "id": "moussaka",
      "title": "Moussaka",
      "image": "optimized/moussaka.webp",
      "description": "Layered eggplant and potato casserole",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "salt",
        "pepper",
        "nutmeg",
        "1 tablespoon of honey",
        "30 g of butter (or margarine for vegan options)",
        "olive oil",
        "1 onion",
        "5 tomatoes (+/- a brick of tomato coulis)",
        "2 eggplants",
        "5 medium potatoes",
        "200g of texturized soja",
        "1 tablespoons of cinnamon"
      ],
      "ingredient_sections": {
        "béchamel": [
          "3 tablespoons of flour",
          "20 g of butter",
          "35 cl of milk"
        ]
      },
      "instruction_blocks": {
        "tomato_sauce": {
          "title": "Preparation of the tomato sauce",
          "steps": [
            "Slice the onions and brown them in a small casserole dish.",
            "Add the tomatoes cut into large cubes and 2 big tablespoons of olive oil, the cinnamon, the honey, salt and pepper. Let everything reduce for 25 minutes over medium heat. You should obtain a sauce, which can be homogenized with ready-made tomato coulis.",
            "Note: If the sauce is too acidic, you can add a small pinch of bicarbonate of soda to balance the acidity."
          ]
        },
        "eggplants": {
          "title": "Preparation of the eggplants",
          "steps": [
            "Cut the eggplants into slices (without peeling them), salt generously, and let them drain while you do the next step. Tip for draining the eggplants: in a dish, alternate a layer of salted eggplant slices and a layer of absorbent paper or leave them in a colander."
          ]
        },
        "potatoes": {
          "title": "Preparation of the potatoes",
          "steps": [
            "Peel and cut the potatoes into thin slices.",
            "Arrange the potato slices in the bottom of a fairly high, oiled gratin dish. Baste the potatoes with a little (3 tablespoons) of the juice released by the simmering tomatoes.",
            "Place the potato dish under the grill for 5 to 15 minutes depending on your oven, so that they brown."
          ]
        },
        "assembly": {
          "title": "Prepare the montage",
          "steps": [
            "Now that they have drained, place the eggplant slices in the pan over high heat to grill them a little on each side, set aside.",
            "Add the texturized soja to the tomato-onion sauce and lower the heat (very low).",
            "Remove the potato dish from the oven and preheat the oven to 200°C (thermostat 6-7)."
          ]
        },
        "béchamel": {
          "title": "Preparation of the béchamel",
          "steps": [
            "In a small casserole dish over low heat, brown the 20 g of butter, add the flour and mix until smooth.",
            "Gradually add the milk, stirring constantly, this can take a good 10 minutes, you should get a fairly thick sauce.",
            "Salt, pepper and grate a little nutmeg."
          ]
        },
        "final_assembly": {
          "title": "Assembly of the moussaka",
          "steps": [
            "Assembly of the moussaka. On top of the layer of potatoes, spread half of the minced meat with the tomato, then half of the eggplants, then the other half of the meat, then the other half of the eggplants, a drizzle of olive oil and finish with the béchamel.",
            "Place everything in the oven at 200°C (thermostat 6-7) and cook for 1 hour (the béchamel should be crispy and golden)."
          ]
        }
      }
    },
    {
      "id": "banana_bread",
      "title": "Banana Bread",
      "image": "optimized/banana_bread.webp",
      "description": "Moist and delicious banana bread",
      "tags": ["desserts", "vegan"],
      "ingredients": [
        "4 medium ripe bananas",
        "120g sugar",
        "75ml sunflower oil",
        "240g wheat flour",
        "3tsp baking powder",
        "40g chopped walnuts (optional)",
        "40g chocolate chips or chopped chocolate (optional)"
      ],
      "instructions": [
        "Preheat the oven to 200°C.",
        "Mash the bananas in a large bowl with the help of a fork. Then, add the sugar and sunflower oil and mix well.",
        "Add the flour and yeast and mix again. Finally, we optionally add the nuts and chocolate chips and mix.",
        "Grease the mold (you can use margarine, olive oil, coconut oil, cooking spray...) and pour the dough into the mold. Optionally, you can sprinkle a little sugar on top to make it crispier.",
        "Bake for 40 minutes at 200°C with the oven previously preheated. After 20 minutes, we'll take a look to see if it's browning too much on top. If so, you just have to cover it with aluminum foil and leave it for 20 more minutes.",
        "Let it cool before unmolding. If you want to unmold it before, it can break."
      ]
    },
    {
      "id": "chocolate_truffles",
      "title": "Chocolate Truffles",
      "image": "optimized/chocolate_truffles.webp",
      "description": "Rich and creamy chocolate truffles",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "80g icing sugar",
        "100g unsalted butter",
        "250g dark chocolate",
        "2 egg yolks",
        "7.5g vanilla sugar",
        "50g cocoa"
      ],
      "instructions": [
        "Break the chocolate into small pieces in a heat-resistant dish. Melt it in a bain-marie.",
        "Gradually add the butter cut into small cubes. Mix.",
        "When the butter has melted into the chocolate, remove the dish from the heat, add the egg yolks, vanilla sugar (it adds crunch, if you want a smooth texture, add 10 g of icing sugar and 1 drop of liquid vanilla) and the icing sugar. Mix everything well.",
        "Put the dough in the fridge for at least an hour so that it solidifies.",
        "Then, form small balls of dough by hand, roll them in the cocoa and then place them on a dish."
      ]
    },
    {
      "id": "rice_pudding",
      "title": "Rice Pudding",
      "image": "optimized/rice_pudding.webp",
      "description": "Creamy and comforting rice pudding",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "orange or clementine",
        "5 tablespoons of sugar",
        "1L of milk",
        "200 g of round white rice",
        "1 sachet of vanilla sugar or vanilla aroma"
      ],
      "instructions": [
        "Boil the milk with the sugar, the vanilla sugar and the zest of your choice.",
        "When the milk boils, throw in the rice and lower the heat so that it boils very slowly; the rice should cook very slowly.",
        "When the rice comes close to the milk level, turn off the heat and let cool; the rice will finish soaking up the milk as it cools.",
        "This dessert can be served warm or cold, depending on your taste."
      ]
    },
    {
      "id": "pizza_dough",
      "title": "Pizza Dough",
      "image": "optimized/pizza_dough.webp",
      "description": "Classic homemade pizza dough",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "350g bread flour + 100g for working the dough",
        "2 teaspoons salt",
        "1 packet baker's yeast",
        "3 tablespoons olive oil",
        "25cl warm water"
      ],
      "instructions": [
        "Put 350g of flour in a large bowl then add successively the salt, baker's yeast and olive oil.",
        "Pour the warm water little by little while mixing with a wooden spoon.",
        "Stir for a long time until you obtain a dough that comes away from the bowl.",
        "Let the dough rest for 1 hour by covering the bowl with a cloth in a warm place.",
        "After the resting time, put flour on your work surface and place the pizza dough on it.",
        "Work it as you would work bread dough.",
        "Shape your pizza to the dimensions of your baking sheet, ideally placing the dough on baking paper.",
        "Garnish your pizza according to your desires or your leftovers in the fridge."
      ]
    }
  ]
} 