{
  "ui": {
    "title": "Mon Journal de Recettes",
    "search_placeholder": "Rechercher des recettes...",
    "section_headers": {
      "dish_types": "Types de Plats",
      "dietary_options": "Options Alimentaires"
    },
    "categories": {
      "all": "Toutes les Recettes",
      "main_courses": "Plats Principaux",
      "desserts": "Desserts",
      "soups": "Soupes"
    },
    "dietary_filters": {
      "vegan": "Végétalien",
      "gluten_free": "Sans Gluten"
    }
  },
  "navigation": {
    "home": "Accueil",
    "breadcrumbs": {
      "separator": "›"
    }
  },
  "recipes": [
    {
      "id": "bourguignon",
      "title": "Bourguignon de Seitan",
      "image": "optimized/bourguignon.webp",
      "description": "Une version végétalienne du plat français classique",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "2 carrés de chocolat noir",
        "500 ml de bouillon de légumes",
        "1 cuillère à soupe de farine",
        "3 carottes",
        "1 oignon",
        "70 ml de vin rouge de Bourgogne",
        "500 g de seitan",
        "300 g de champignons",
        "2 gousses d'ail",
        "20 g de margarine",
        "1 bouquet garni",
        "Sel et poivre"
      ],
      "instructions": [
        "La veille ou le matin pour le dîner :",
        "Rincez les légumes et hachez finement l'ail, l'oignon et les champignons. Coupez les carottes en morceaux de 1 cm.",
        "Dans une casserole à feu moyen, faites fondre la margarine. Ajoutez l'ail, l'oignon, les carottes et les champignons. Faites revenir pendant 5 minutes.",
        "Coupez le seitan en gros cubes, similaires à de la viande de ragoût.",
        "Ajoutez le seitan à la casserole et laissez-le dorer pendant 2 minutes.",
        "Déglacez avec tout le vin rouge, en grattant les morceaux du fond avec une spatule.",
        "Ajoutez le bouquet garni et retirez du feu.",
        "Couvrez et laissez mariner toute la nuit.",
        "Le lendemain, versez le bouillon de légumes dans la casserole. Assaisonnez avec du sel et du poivre.",
        "Remettez à cuire, en mijotant pendant 1 heure à feu moyen-doux. Avant de servir, ajoutez les carrés de chocolat noir et remuez jusqu'à ce qu'ils soient fondus pour lier la sauce.",
        "C'est prêt ! Servez avec du riz ou des pâtes sans œufs."
      ]
    },
    {
      "id": "lentils_soup",
      "title": "Soupe aux Lentilles",
      "image": "optimized/lentils_soup.webp",
      "description": "Soupe de lentilles chaude et nutritive",
      "tags": ["soups", "vegan", "gluten_free"],
      "ingredients": [
        "3 cuillères à soupe d'huile d'olive",
        "1 oignon",
        "1 carotte",
        "1 poireau blanc",
        "1 échalote",
        "150g de lentilles vertes",
        "2 cubes de bouillon",
        "1L d'eau"
      ],
      "instructions": [
        "Épluchez le poireau blanc, la carotte, l'oignon et l'échalote, et coupez en mirepoix (petits dés).",
        "Dans une casserole, mettez trois cuillères à soupe d'huile d'olive et faites suer les légumes pendant 5 à 10 minutes à feu doux.",
        "Ajoutez les lentilles, en les mélangeant bien avec les légumes pour qu'elles deviennent translucides et absorbent les saveurs des légumes.",
        "Ajoutez 1 litre d'eau, deux cubes de bouillon, et laissez mijoter pendant 3/4 d'heure.",
        "Mixez la préparation (pas de moulin à légumes, le mixeur laisse de petits morceaux pour une consistance plus agréable).",
        "Servez chaud avec des croûtons, un peu de fromage râpé, ou des œufs durs."
      ]
    },
    {
      "id": "moussaka",
      "title": "Moussaka",
      "image": "optimized/moussaka.webp",
      "description": "Casserole d'aubergines et pommes de terre en couches",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "sel",
        "poivre",
        "noix de muscade",
        "1 cuillère à soupe de miel",
        "30 g de beurre (ou margarine pour les options végétaliennes)",
        "huile d'olive",
        "1 oignon",
        "5 tomates (+/- une brique de coulis de tomates)",
        "2 aubergines",
        "5 pommes de terre moyennes",
        "500 g de viande hachée (ou substitut végétal)",
        "2 œufs (ou substitut végétal)",
        "200 ml de lait (ou lait végétal)",
        "50 g de fromage râpé (ou substitut végétal)"
      ],
      "instructions": [
        "Préchauffez le four à 180°C (350°F).",
        "Coupez les aubergines en tranches et faites-les griller jusqu'à ce qu'elles soient tendres.",
        "Faites cuire les pommes de terre en tranches jusqu'à ce qu'elles soient presque tendres.",
        "Dans une poêle, faites revenir l'oignon haché dans l'huile d'olive.",
        "Ajoutez la viande hachée et faites-la cuire jusqu'à ce qu'elle soit dorée.",
        "Ajoutez les tomates, le sel, le poivre et laissez mijoter pendant 10 minutes.",
        "Dans un plat à gratin, alternez les couches : pommes de terre, aubergines, sauce à la viande.",
        "Préparez la béchamel en mélangeant le lait, les œufs, le fromage, la noix de muscade.",
        "Versez la béchamel sur le dessus.",
        "Faites cuire au four pendant 30-40 minutes jusqu'à ce que le dessus soit doré."
      ]
    },
    {
      "id": "banana_bread",
      "title": "Pain aux Bananes",
      "image": "optimized/banana_bread.webp",
      "description": "Pain moelleux aux bananes mûres",
      "tags": ["desserts", "vegan"],
      "ingredients": [
        "4 bananes mûres moyennes",
        "120g de sucre",
        "75ml d'huile de tournesol",
        "240g de farine de blé",
        "3 c.à.c de levure chimique",
        "40g de noix hachées (optionnel)",
        "40g de pépites de chocolat ou chocolat haché (optionnel)"
      ],
      "instructions": [
        "Préchauffez le four à 200°C.",
        "Écrasez les bananes dans un grand bol à l'aide d'une fourchette. Puis, ajoutez le sucre et l'huile de tournesol et mélangez bien.",
        "Ajoutez la farine et la levure et mélangez à nouveau. Enfin, nous ajoutons optionnellement les noix et les pépites de chocolat et mélangeons.",
        "Graissez le moule (vous pouvez utiliser de la margarine, de l'huile d'olive, de l'huile de coco, un spray de cuisson...) et versez la pâte dans le moule. Optionnellement, vous pouvez saupoudrer un peu de sucre sur le dessus pour le rendre plus croustillant.",
        "Faites cuire pendant 40 minutes à 200°C avec le four préalablement préchauffé. Après 20 minutes, nous jetterons un coup d'œil pour voir si ça dore trop sur le dessus. Si c'est le cas, il suffit de le couvrir avec du papier aluminium et laisser encore 20 minutes.",
        "Laissez refroidir avant de démouler. Si vous voulez le démouler avant, il peut se casser."
      ]
    },
    {
      "id": "chocolate_truffles",
      "title": "Truffes au Chocolat",
      "image": "optimized/chocolate_truffles.webp",
      "description": "Truffes au chocolat riches et crémeuses",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "80g de sucre glace",
        "100g de beurre non salé",
        "250g de chocolat noir",
        "2 jaunes d'œufs",
        "7.5g de sucre vanillé",
        "50g de cacao"
      ],
      "instructions": [
        "Cassez le chocolat en petits morceaux dans un plat résistant à la chaleur. Faites-le fondre au bain-marie.",
        "Ajoutez progressivement le beurre coupé en petits cubes. Mélangez.",
        "Quand le beurre a fondu dans le chocolat, retirez le plat du feu, ajoutez les jaunes d'œufs, le sucre vanillé (il ajoute du croquant, si vous voulez une texture lisse, ajoutez 10 g de sucre glace et 1 goutte de vanille liquide) et le sucre glace. Mélangez bien le tout.",
        "Mettez la pâte au réfrigérateur pendant au moins une heure pour qu'elle se solidifie.",
        "Ensuite, formez de petites boules de pâte à la main, roulez-les dans le cacao puis placez-les sur un plat."
      ]
    },
    {
      "id": "rice_pudding",
      "title": "Riz au Lait",
      "image": "optimized/rice_pudding.webp",
      "description": "Riz au lait crémeux et réconfortant",
      "tags": ["desserts", "gluten_free"],
      "ingredients": [
        "orange ou clémentine",
        "5 cuillères à soupe de sucre",
        "1L de lait",
        "200 g de riz blanc rond",
        "1 sachet de sucre vanillé ou arôme vanille"
      ],
      "instructions": [
        "Faites bouillir le lait avec le sucre, le sucre vanillé et le zeste de votre choix.",
        "Quand le lait bout, jetez-y le riz et baissez le feu pour qu'il bouille très lentement ; le riz doit cuire très lentement.",
        "Quand le riz arrive près du niveau du lait, éteignez le feu et laissez refroidir ; le riz finira d'absorber le lait en refroidissant.",
        "Ce dessert peut être servi chaud ou froid, selon votre goût."
      ]
    },
    {
      "id": "pizza_dough",
      "title": "Pâte à Pizza",
      "image": "optimized/pizza_dough.webp",
      "description": "Pâte à pizza maison classique",
      "tags": ["main_courses", "vegan"],
      "ingredients": [
        "350g de farine (type pâte à pain) + 100g pour travailler la pâte",
        "2 cuillères à café de sel",
        "1 sachet de levure boulangère",
        "3 cuillères à soupe d'huile d'olive",
        "25cl d'eau tiède"
      ],
      "instructions": [
        "Mettre 350g de farine dans un grand saladier puis ajouter successivement le sel, la levure boulangère et l'huile d'olive.",
        "Verser petit à petit l'eau tiède tout en mélangeant avec une cuillère en bois.",
        "Remuer longuement jusqu'à obtention d'une pâte qui se détache du saladier.",
        "Laisser reposer la pâte pendant 1h en couvrant le saladier avec un torchon dans un endroit chaud.",
        "Après le temps de repos, déposer de la farine sur votre plan de travail y déposer la pâte à pizza.",
        "La travailler comme on travaillerait une pâte à pain.",
        "Façonner votre pizza aux dimensions de votre plaque à four où l'idéal, c'est de déposer la pâte sur du papier cuisson.",
        "Agrémenter votre pizza au grès de vos envies ou de vos restes dans le frigo."
      ]
    }
  ]
} 